{"id":1499,"date":"2013-09-04T12:43:56","date_gmt":"2013-09-04T12:43:56","guid":{"rendered":"https:\/\/mann.vamtam.com\/?p=1499"},"modified":"2019-02-21T13:40:47","modified_gmt":"2019-02-21T13:40:47","slug":"the-ofccp-war-game","status":"publish","type":"post","link":"https:\/\/mann.vamtam.com\/the-ofccp-war-game\/","title":{"rendered":"The OFCCP War Game"},"content":{"rendered":"<div class=\"fl-builder-content fl-builder-content-1499 fl-builder-global-templates-locked\" data-post-id=\"1499\"><div class=\"fl-row fl-row-full-width fl-row-bg-none fl-node-57a6fae445929 fl-row-bg-attachment-scroll\" data-node=\"57a6fae445929\">\n\t<div class=\"fl-row-content-wrap\">\n\t\t\t\t\t\t<div class=\"fl-row-content fl-row-fixed-width fl-node-content\">\n\t\t\n<div class=\"fl-col-group fl-node-57a6fae447449\" data-node=\"57a6fae447449\">\n\t\t\t<div class=\"fl-col fl-node-57a6fae447875\" data-node=\"57a6fae447875\">\n\t<div class=\"fl-col-content fl-node-content\">\n\t<div class=\"fl-module fl-module-rich-text fl-node-57a6fae44b83f\" data-node=\"57a6fae44b83f\">\n\t<div class=\"fl-module-content fl-node-content\">\n\t\t<div class=\"fl-rich-text\">\n\t<p><strong>OK, so, before I start this rant let me go on record that, not being in government recruiting in a high-profile company I can allow myself some venom. That should be telling that with pure free speech out there and a President who feels the need to share everything without reprisal should be telling. Thank you for being a part of this my friend.  Now, I digress.<\/strong><\/p>\n<p>Just a mere short years ago I wrote a two-part missive on what to expect from the new changes that were coming, and now here, and the pit falls with shaved bamboo at the bottom has brought us to.  Recruiters and Sourcers were right to be afraid, very afraid of the oncoming onslaught of ridonculousness that has now ensued. Sadly, it was not the Government but the Human Resources or as I like to call them the “keepers of lawsuits” (they hate that term by the way) that became grabbing pitchforks and torches heading for the castle of the C suite with yet another complication and letting said C suite explain why they are somewhat relevant.  <\/p>\n<p>Recruiting has been forced by the OFCCP to start collecting data on hiring veterans and people with disabilities what started out as a noble effort has turned into nightmarish red tape.  All the Department of Labor wanted was to track some numbers, but somehow a government organization has now stepped in and attempted to develop, deliver, and drive the strategy of how private companies should recruit and hire.  Why?  Because recruiting (and really HR) is so messed up that we can’t even count and sort our applicants? Recruiting should be OFFENDED and PISSED OFF that the government has said we suck so bad at our jobs that they need to teach US things.  I won’t even touch on the fact that half of the veterans applying to places don’t self-identify because HR just can’t freaking help themselves from tripping over their self-righteousness to race over and “help” these guys apply by pulling them from the normal recruiting pool and dumping them off in a separate bucket because “well, we are NOW being held accountable for something we should have done in the first place.”<\/p>\n<p>HR never does a single thing with recruiting daily that helps us, it just hinders us. Except when we find out someone is a veteran, then they are right there to mess it up with red tape instead of a red carpet.<\/p>\n<p>One of the continuing challenges that employers\/transitioning veterans face in the employment cycle - 99% of hiring processes and styles are based on matching functional skills between job & candidate. But when we look at veterans, we keep trying to match a diversity group to a functional skillset, which creates chaos in the processes and is near impossible to do.<\/p>\n<p>Don’t believe me?  Let’s look at the numbers, shall we?  In order to hire and maintain the percentage that Federal contractors need to reach, which is 8% of the employees being a veteran status, it is a statistically impossible number to reach!  Average software would not foster nor need a logistics officer or supply sergeant yet since now, being forced upon this dystopian thought process HR, fearing reprisal and unknown fines will go out of their way to prove that a Marine can indeed write code in C#.  <\/p>\n<\/div>\n\t<\/div>\n<\/div>\n\t<\/div>\n<\/div>\n\t<\/div>\n\t\t<\/div>\n\t<\/div>\n<\/div>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Adams also came to understand how important it was that his carefully crafted photos were reproduced to best effect. At Bender’s invitation, he joined the prestigious Roxburghe Club, an association devoted to fine printing and high standards in book arts.<\/p>\n","protected":false},"author":2,"featured_media":15903,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[18],"tags":[],"jetpack_featured_media_url":"https:\/\/mann.vamtam.com\/wp-content\/uploads\/2018\/06\/picture-14.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/posts\/1499"}],"collection":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/comments?post=1499"}],"version-history":[{"count":0,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/posts\/1499\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/media\/15903"}],"wp:attachment":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/media?parent=1499"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/categories?post=1499"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/tags?post=1499"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}