{"id":5357,"date":"2013-09-06T23:35:16","date_gmt":"2013-09-06T23:35:16","guid":{"rendered":"https:\/\/mann.vamtam.com\/?p=5357"},"modified":"2019-02-21T13:40:47","modified_gmt":"2019-02-21T13:40:47","slug":"workplaces-of-the-world","status":"publish","type":"post","link":"https:\/\/mann.vamtam.com\/workplaces-of-the-world\/","title":{"rendered":"Workplaces of the World, It’s Time to Tell Your Story!"},"content":{"rendered":"<div class=\"fl-builder-content fl-builder-content-5357 fl-builder-global-templates-locked\" data-post-id=\"5357\"><div class=\"fl-row fl-row-full-width fl-row-bg-none fl-node-57a6f952646cc fl-row-bg-attachment-scroll\" data-node=\"57a6f952646cc\">\n\t<div class=\"fl-row-content-wrap\">\n\t\t\t\t\t\t<div class=\"fl-row-content fl-row-fixed-width fl-node-content\">\n\t\t\n<div class=\"fl-col-group fl-node-57a6f9526655c\" data-node=\"57a6f9526655c\">\n\t\t\t<div class=\"fl-col fl-node-57a6f95266a28\" data-node=\"57a6f95266a28\">\n\t<div class=\"fl-col-content fl-node-content\">\n\t<div class=\"fl-module fl-module-rich-text fl-node-57a6f9526a566\" data-node=\"57a6f9526a566\">\n\t<div class=\"fl-module-content fl-node-content\">\n\t\t<div class=\"fl-rich-text\">\n\t<p><strong>What an incredible time it is for storytelling. There are so many accessible ways to create stories and so many mediums on which to share them. If you watched any of the Golden Globes this past week, you heard the cries for even more storytelling and story-sharing – it’s through our stories that we all grow.<\/strong><\/p>\n<p>But it’s not just the stories that are being requested by the masses, it’s “honesty” and “authenticity”. I put these words in quotes because let’s be honest, what we see on screen is generally filtered to various extents, but undoubtedly, the real is craved. I wonder, what if each of our workplaces had a channel that tuned right in to what was happening within our office walls? Who would watch? What’s uniquely happening there? Who would get hooked?<\/p>\n<p>Ever since the very first workplace documentary I made, I was hooked on sharing people’s job stories. Not just because it’s so interesting to meet different people, but because there’s a lot of really good jobs out there whose stories simply are not told. Seemingly boring jobs that could absolutely be someone’s dream job – someone who might not be of age to work quite yet.<\/p>\n<p>Something else I notice happens when our workplaces begin telling their stories – they learn a whole lot about themselves in the process. If you want to crack the code on your company’s employment brand, you have to begin finding and learning its stories. Those stories are not just about covering the responsibilities of the job, it’s revealing the tone, pace, approach and experiences of the people successfully executing that job.<\/p>\n<p>When I met Train Engineer Jackie Pettyjohn, we shadowed her throughout two of the nightshifts she has been working for 20 years on the rail yard in Philadelphia. It was through her story that employees rallied around to celebrate her, but ultimately, surface an enthusiasm and a spirit that represents the company so purely. It’s beautiful.<\/p>\n<p><strong>And then there was Headend Technician Peter Imler, who was working on Long Beach Island for Comcast.<\/strong><\/p>\n<p>A man who typically works alone most of the day, but is part of a large organization and has a grand responsibility. Peter has accomplished a lot of brave work from his post, and it serves his colleagues well to know more about it.<\/p>\n<p>For those who have begun to take on the positions of “employment branding” and “recruitment marketing” – what is our rallying cry? Can there be an overarching goodwill mission to what we are all doing, recognizing that together we can tell the stories of the workplaces of the world? We can expose individuals to ideas, roles and opportunities they never knew were available.<\/p>\n<p>This has inspired my cry, “Workplaces of the world – tell your stories!” You’ll not only inspire your future workforce, you’ll reveal your company’s true spirit in the meantime.<\/p>\n<\/div>\n\t<\/div>\n<\/div>\n\t<\/div>\n<\/div>\n\t<\/div>\n\t\t<\/div>\n\t<\/div>\n<\/div>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>What an incredible time it is for storytelling. There are so many accessible ways to create stories and so many mediums on which to share them. If you watched any of the Golden Globes this past week, you heard the cries for even more storytelling and story-sharing – it’s through our stories that we all&#8230;<\/p>\n","protected":false},"author":2,"featured_media":15632,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[605],"tags":[],"jetpack_featured_media_url":"https:\/\/mann.vamtam.com\/wp-content\/uploads\/2014\/03\/post-2.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/posts\/5357"}],"collection":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/comments?post=5357"}],"version-history":[{"count":0,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/posts\/5357\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/media\/15632"}],"wp:attachment":[{"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/media?parent=5357"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/categories?post=5357"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mann.vamtam.com\/wp-json\/wp\/v2\/tags?post=5357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}